---
type: RevitCommandId
namespace: Autodesk.Revit.UI
version: 2024
members: 8
tags: [revit-api, class]
---

# RevitCommandId

`Autodesk.Revit.UI.RevitCommandId` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | LookupCommandId | 2013 | `public static RevitCommandId LookupCommandId ( string name )` |
| Method | LookupPostableCommandId | 2014 | `public static RevitCommandId LookupPostableCommandId ( PostableCommand postableCommand )` |
| Property | CanHaveBinding | 2013 | `public bool CanHaveBinding { get ; }` |
| Property | HasBinding | 2013 | `public bool HasBinding { get ; }` |
| Property | Id | 2013 | `public uint Id { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2013 | `public string Name { get ; }` |